In [61]:
import pandas as pd
import numpy as np

In [62]:
sozlukVerisi = {"İstanbul" : [30,20,np.nan], "Bursa" : [20,np.nan,15], "Ankara" : [10,40,25]}
havaDurumuDF = pd.DataFrame(data=sozlukVerisi,index=["Pazartesi","Salı","Çarşamba"])

In [63]:
havaDurumuDF

           İstanbul  Bursa  Ankara
Pazartesi      30.0   20.0      10
Salı           20.0    NaN      40
Çarşamba        NaN   15.0      25

In [64]:
havaDurumuDF.dropna() #nan değer bulunmayan satırları gösterir

           İstanbul  Bursa  Ankara
Pazartesi      30.0   20.0      10

In [65]:
havaDurumuDF.dropna(axis=1) #nan değer bulunmayan kolonları gösterir

           Ankara
Pazartesi      10
Salı           40
Çarşamba       25

In [66]:
yeniVeri = {"İstanbul" : [30,20,np.nan], "Bursa" : [20,np.nan,15], "Ankara" : [10,40,25], "İzmir" : [24,np.nan,np.nan]}
yeniDF = pd.DataFrame(data=yeniVeri,index=["Pazartesi","Salı","Çarşamba"])

In [67]:
yeniDF

           İstanbul  Bursa  Ankara  İzmir
Pazartesi      30.0   20.0      10   24.0
Salı           20.0    NaN      40    NaN
Çarşamba        NaN   15.0      25    NaN

In [68]:
yeniDF.dropna(axis=1, thresh=2) #thresh -> 2 veya daha fazla nan değer bulunuyorsa sil anlamına gelir

           İstanbul  Bursa  Ankara
Pazartesi      30.0   20.0      10
Salı           20.0    NaN      40
Çarşamba        NaN   15.0      25

In [69]:
yeniDF.fillna(20) # nan değerlere 20 değerini atar

           İstanbul  Bursa  Ankara  İzmir
Pazartesi      30.0   20.0      10   24.0
Salı           20.0   20.0      40   20.0
Çarşamba       20.0   15.0      25   20.0

## Groupby

In [70]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Satış", "Satış", "Pazarlama", "Pazarlama"],
"İsim" : ["Behçet", "Gizem", "Şevval", "Yavuz", "Mert", "Mete"], "Maaş" : [8000,7800,7600,7500,7400,7300]
}
maasDataFrame = pd.DataFrame(maasSozlugu)

In [71]:
maasDataFrame

   Departman    İsim  Maaş
0    Yazılım  Behçet  8000
1    Yazılım   Gizem  7800
2      Satış  Şevval  7600
3      Satış   Yavuz  7500
4  Pazarlama    Mert  7400
5  Pazarlama    Mete  7300

In [72]:
grupObjesi = maasDataFrame.groupby("Departman") #departman başlığına göre sınıflandırma yapılacağını belirtir. Index yapar

In [73]:
grupObjesi.count() #departmanlarda kaç tane isim verisi ve maaş verisi olduğunu gösterir

           İsim  Maaş
Departman
Pazarlama     2     2
Satış         2     2
Yazılım       2     2

In [74]:
grupObjesi.mean() #departmanlarda sayı varsa(maaş verisi gibi) ortalamasını alır

C:\Users\behce\AppData\Local\Temp\ipykernel_10960\3938959511.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean() #departmanlarda sayı varsa(maaş verisi gibi) ortalamasını alır

             Maaş
Departman
Pazarlama  7350.0
Satış      7550.0
Yazılım    7900.0

In [75]:
grupObjesi.max() #en yüksek maaş alanları gösterir. min() en az alanları gösterir

             İsim  Maaş
Departman
Pazarlama    Mete  7400
Satış      Şevval  7600
Yazılım     Gizem  8000

In [76]:
grupObjesi.describe() #departmanlarla ilgili tüm verileri gösterir

           Maaş
          count    mean         std     min     25%     50%     75%     max
Departman
Pazarlama   2.0  7350.0   70.710678  7300.0  7325.0  7350.0  7375.0  7400.0
Satış       2.0  7550.0   70.710678  7500.0  7525.0  7550.0  7575.0  7600.0
Yazılım     2.0  7900.0  141.421356  7800.0  7850.0  7900.0  7950.0  8000.0